In [1]:
import pandas as pd
import numpy as np

In [9]:
data = np.random.randn(4,3)

In [11]:
data

array([[ 0.41954009, -2.48929798, -0.409326  ],
       [ 1.17629814,  0.76028203, -0.5466544 ],
       [-0.73142213, -0.38407364,  0.97882712],
       [ 0.28224611,  1.06798716, -0.45321711]])

In [14]:
dataFrame = pd.DataFrame(data)

In [19]:
dataFrame

          0         1         2
0  0.419540 -2.489298 -0.409326
1  1.176298  0.760282 -0.546654
2 -0.731422 -0.384074  0.978827
3  0.282246  1.067987 -0.453217

In [20]:
dataFrame[1]

0   -2.489298
1    0.760282
2   -0.384074
3    1.067987
Name: 1, dtype: float64

In [36]:
yeniDataFrame = pd.DataFrame(data, index=["Atil","Zeynep","Atlas","Mehmet"], columns=["Maas","Yas","Calisma Saati"])

In [37]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.419540 -2.489298      -0.409326
Zeynep  1.176298  0.760282      -0.546654
Atlas  -0.731422 -0.384074       0.978827
Mehmet  0.282246  1.067987      -0.453217

In [38]:
yeniDataFrame.loc["Atil"] ##row seçmek için

Maas             0.419540
Yas             -2.489298
Calisma Saati   -0.409326
Name: Atil, dtype: float64

In [39]:
yeniDataFrame.iloc[0]

Maas             0.419540
Yas             -2.489298
Calisma Saati   -0.409326
Name: Atil, dtype: float64

In [40]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.419540 -2.489298      -0.409326
Zeynep  1.176298  0.760282      -0.546654
Atlas  -0.731422 -0.384074       0.978827
Mehmet  0.282246  1.067987      -0.453217

In [41]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"] ## yeni kolon ekleme

In [42]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.419540 -2.489298      -0.409326       -4.978596
Zeynep  1.176298  0.760282      -0.546654        1.520564
Atlas  -0.731422 -0.384074       0.978827       -0.768147
Mehmet  0.282246  1.067987      -0.453217        2.135974

In [44]:
yeniDataFrame.drop("Emeklilik Yasi", axis=1)

            Maas       Yas  Calisma Saati
Atil    0.419540 -2.489298      -0.409326
Zeynep  1.176298  0.760282      -0.546654
Atlas  -0.731422 -0.384074       0.978827
Mehmet  0.282246  1.067987      -0.453217

In [45]:
yeniDataFrame.drop("Mehmet", axis=0)# bunda axis yazmasanda siliyor

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.419540 -2.489298      -0.409326       -4.978596
Zeynep  1.176298  0.760282      -0.546654        1.520564
Atlas  -0.731422 -0.384074       0.978827       -0.768147

In [46]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.419540 -2.489298      -0.409326       -4.978596
Zeynep  1.176298  0.760282      -0.546654        1.520564
Atlas  -0.731422 -0.384074       0.978827       -0.768147
Mehmet  0.282246  1.067987      -0.453217        2.135974

In [47]:
yeniDataFrame.drop("Emeklilik Yasi", axis=1 , inplace=True)

In [48]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.419540 -2.489298      -0.409326
Zeynep  1.176298  0.760282      -0.546654
Atlas  -0.731422 -0.384074       0.978827
Mehmet  0.282246  1.067987      -0.453217

In [50]:
yeniDataFrame.loc["Atil"]["Yas"]

-2.489297984181491

In [51]:
yeniDataFrame.loc["Atil","Yas"]

-2.489297984181491

In [53]:
yeniDataFrame<0

         Maas    Yas  Calisma Saati
Atil    False   True           True
Zeynep  False  False           True
Atlas    True   True          False
Mehmet  False  False           True

In [54]:
yeniDataFrame[yeniDataFrame<0]

            Maas       Yas  Calisma Saati
Atil         NaN -2.489298      -0.409326
Zeynep       NaN       NaN      -0.546654
Atlas  -0.731422 -0.384074            NaN
Mehmet       NaN       NaN      -0.453217

In [55]:
yeniDataFrame[yeniDataFrame["Calisma Saati"]>0]

           Maas       Yas  Calisma Saati
Atlas -0.731422 -0.384074       0.978827

In [56]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0    Atil  0.419540 -2.489298      -0.409326
1  Zeynep  1.176298  0.760282      -0.546654
2   Atlas -0.731422 -0.384074       0.978827
3  Mehmet  0.282246  1.067987      -0.453217

In [57]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.419540 -2.489298      -0.409326
Zeynep  1.176298  0.760282      -0.546654
Atlas  -0.731422 -0.384074       0.978827
Mehmet  0.282246  1.067987      -0.453217

In [58]:
yeniIndeksListesi = ["Ati","Zey","Atl","Meh"]

In [59]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi

In [60]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Atil    0.419540 -2.489298      -0.409326         Ati
Zeynep  1.176298  0.760282      -0.546654         Zey
Atlas  -0.731422 -0.384074       0.978827         Atl
Mehmet  0.282246  1.067987      -0.453217         Meh

In [61]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati          0.419540 -2.489298      -0.409326
Zey          1.176298  0.760282      -0.546654
Atl         -0.731422 -0.384074       0.978827
Meh          0.282246  1.067987      -0.453217

## MultiIndeks

In [62]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [63]:
icIndeksler = ["Homer", "Bart", "Marge", "Cartmen", "Kenny", "Kyle"]

In [64]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [65]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartmen'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [68]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [69]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartmen'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [70]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [71]:
benimCizgiFilmListem

[[40, 'A'], [10, 'B'], [30, 'C'], [9, 'D'], [10, 'E'], [11, 'F']]

In [72]:
cizgiFilmNumpy = np.array(benimCizgiFilmListem)

In [78]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpy,index=birlesmisIndeks,columns=["Yas","Meslek"])

In [79]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartmen   9      D
           Kenny    10      E
           Kyle     11      F

In [81]:
cizgiFilmDataFrame.loc["Simpson","Homer"]

Yas       40
Meslek     A
Name: (Simpson, Homer), dtype: object

In [82]:
cizgiFilmDataFrame.index.names = ["Film Adı","İsim"]

In [83]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartmen   9      D
           Kenny    10      E
           Kyle     11      F